Repository: Amin2003713/SmartAttendance
Catalog: src/Common/Shifty.Resources/Resources/Messages/CommonMessages.*.resx
Languages: fa_ir

# Code_Generator
source: Code generator encountered an error.
fa_ir: تولیدکننده کد با خطا مواجه شد.

# Server_Error
source: An internal server error occurred.
fa_ir: یک خطای داخلی سرور رخ داده است.

# Refresh_Token_Found
source: A refresh token was found.
fa_ir: یک توکن تازه‌سازی یافت شد.

# Unauthorized_Access
source: You are not authorized to access this resource.
fa_ir: شما مجاز به دسترسی به این منبع نیستید.

# NotFound_Title
source: Not Found
fa_ir: یافت نشد

# InternalServerError_Title
source: Server Error
fa_ir: خطای سرور

# Conflict_Title
source: Conflict
fa_ir: تضاد

# Unauthorized_Title
source: Unauthorized
fa_ir: دسترسی غیرمجاز

# Forbidden_Title
source: Forbidden
fa_ir: ممنوع

# NotFound_Detail
source: The requested resource was not found.
fa_ir: منبع مورد نظر یافت نشد.

# Conflict_Detail
source: A conflict occurred with an existing record.
fa_ir: یک تضاد با رکورد موجود رخ داده است.

# Unauthorized_Detail
source: You do not have permission to access this resource.
fa_ir: شما مجوز دسترسی به این منبع را ندارید.

# Forbidden_Detail
source: You are not allowed to access this resource.
fa_ir: شما اجازه دسترسی به این منبع را ندارید.

# Validation_Title_Generic
source: Validation Error
fa_ir: خطای اعتبارسنجی

# Validation_Title_NotFound
source: Not Found
fa_ir: یافت نشد

# Validation_Title_Unauthorized
source: Unauthorized
fa_ir: دسترسی غیرمجاز

# Validation_Title_Forbidden
source: Forbidden
fa_ir: ممنوع

# Tenant_Error_ParamsMissing
source: Required tenant parameters were not present in headers.
fa_ir: پارامترهای ضروری در هدرها وجود ندارد.

# Tenant_Error_NotFound
source: The specified tenant was not found.
fa_ir: تننت مورد نظر یافت نشد.

# Tenant_Tip_Params
source: Add tenant identifier to headers (e.g., __tenant__:Domain)
fa_ir: شناسه تننت را به هدرها اضافه کنید (مثال: __tenant__:Domain)

# Device_Error_MissingHeader
source: Required device header parameter was not present.
fa_ir: پارامتر ضروری در هدرها وجود ندارد.

# Device_Tip_Hardware
source: Add hardware ID header for mobile applications
fa_ir: برای برنامه‌های موبایل، هدر شناسه سخت‌افزاری را اضافه کنید

# Device_Tip_DeviceType
source: Add X_Device_Type header with values like Browser, Android, iOS, Windows, macOS
fa_ir: هدر X_Device_Type را با مقادیری مانند Browser, Android, iOS, Windows, macOS اضافه کنید.

# Hardware_Error_AlreadyRegistered
source: This username has already been registered on another device.
fa_ir: این نام کاربری قبلاً روی دستگاه دیگری ثبت شده است.

# Hardware_Error_Mismatch
source: Hardware ID must match the device used during initial registration.
fa_ir: شناسه سخت‌افزاری باید با دستگاه ثبت اولیه مطابقت داشته باشد.
