Repository: Amin2003713/SmartAttendance
Catalog: src/Common/Shifty.Resources/Resources/Messages/UserMessages.*.resx
Languages: fa_ir

source: User already exists.
fa_ir: کاربر از قبل وجود دارد.

# Verify_Two_Factor_Token
source: Please verify the two-factor authentication token.
fa_ir: لطفاً توکن احراز هویت دو مرحله‌ای را تأیید کنید.

# User_Activation_Failed
source: Use Activation Failed Duo to some Exeptions
fa_ir: فعال سازی کاربر با خطا مواجه شد.

# InCorrect_User_Password
source: Incorrect username or password.
fa_ir: نام کاربری یا رمز عبور نادرست است.

source: User not found.
fa_ir: کاربر پیدا نشد.

# Identity_Error
source: An identity error occurred.
fa_ir: خطای هویتی رخ داده است.

# User_Conflict
source: User conflict detected.
fa_ir: تضاد کاربر شناسایی شد.

# InValid_Token
source: The token provided is invalid.
fa_ir: توکن ارائه شده نامعتبر است.

# User_Error_NotActive
source: User is not active.
fa_ir: کاربر فعال نیست.

# NotAllowed
source: You are not Allowed to perform such action.
fa_ir: شما مجاز به انجام این کار نیستید.

# Password_Change_Error
source: there was an problem with password
fa_ir: تغییر رمزعبور موفقیت امیز نبود.

# PhoneNumberRequired
source: Phone number is required.
fa_ir: شماره تلفن ضروری است.

# PhoneNumberMinDigits
source: Phone number must contain at least 10 digits.
fa_ir: شماره تلفن باید حداقل ۱۰ رقم داشته باشد.

# PasswordRequired
source: New Password is required.
fa_ir: رمز عبور جدید الزامی است.

# PasswordMinLength
source: Password must be at least 6 characters long.
fa_ir: رمز عبور باید حداقل ۶ کاراکتر باشد.

# PasswordUppercaseRequired
source: Password must contain at least one uppercase letter.
fa_ir: رمز عبور باید حداقل یک حرف بزرگ داشته باشد.

# PasswordLowercaseRequired
source: Password must contain at least one lowercase letter.
fa_ir: رمز عبور باید حداقل یک حرف کوچک داشته باشد.

# PasswordDigitRequired
source: Password must contain at least one numeric digit.
fa_ir: رمز عبور باید حداقل یک عدد داشته باشد.

# PasswordSpecialRequired
source: Password must contain at least one special character.
fa_ir: رمز عبور باید حداقل یک کاراکتر ویژه داشته باشد.

# ConfirmPasswordRequired
source: Confirm Password is required.
fa_ir: تأیید رمز عبور ضروری است.

# ConfirmPasswordMustMatch
source: Confirm Password must match New Password.
fa_ir: رمز عبور تأییدی باید با رمز عبور جدید یکسان باشد.

# New_Password_Must_not_be_equal_to_Old_password
source: new password cannot be the same as old one
fa_ir: رمز عبور جدید نمیتواند مشابه رمز عبور قبلی باشد.
