Repository: Amin2003713/SmartAttendance
Catalog: src/Common/Shifty.Resources/Resources/Messages/ValidationMessages.*.resx
Languages: fa_ir

# Domain_Required
source: Organization identifier is required.
fa_ir: شناسه سازمان الزامی است.

# Domain_MaxLength
source: Organization identifier cannot exceed 63 characters.
fa_ir: شناسه سازمان نمی‌تواند بیشتر از ۶۳ کاراکتر باشد.

# Domain_InvalidHyphen
source: Organization identifier cannot start or end with a hyphen.
fa_ir: شناسه سازمان نمی‌تواند با خط فاصله شروع یا پایان یابد.

# Domain_InvalidCharacters
source: Organization identifier can only contain letters, numbers.
fa_ir: شناسه سازمان فقط می‌تواند شامل حروف الفبا، اعداد باشد.

# FirstName_Required
source: First name is required.
fa_ir: نام الزامیست.

# FirstName_Length
source: First name must be between 2 and 255 characters.
fa_ir: حداقل طول نام 2 حرف و حداکثر 255 حرف می‌باشد.

# LastName_Required
source: Last name is required.
fa_ir: نام خانوادگی الزامیست.

# LastName_Length
source: Last name must be between 2 and 255 characters.
fa_ir: حداقل طول نام خانوادگی 2 حرف و حداکثر 255 حرف می‌باشد.

# OrganizationName_Required
source: Organization name is required.
fa_ir: نام سازمان الزامی است.

# PhoneNumber_Required
source: Phone number is required.
fa_ir: شماره تلفن الزامی است.

# PhoneNumber_InvalidFormat
source: Phone number must follow Iranian format.
fa_ir: شماره تلفن باید مطابق با فرمت شماره تلفن ایران باشد.

# Username_Required
source: Username is required.
fa_ir: نام کاربری اجباری است.

# Password_Required
source: Password is required.
fa_ir: رمز عبور اجباری است.

# Password_MinLength
source: Password must be at least 8 characters long.
fa_ir: طول رمز عبور باید حداقل 8 کاراکتر باشد

# Property_RefreshToken
source: Refresh Token
fa_ir: توکن بازآوری

# Property_AccessToken
source: Access Token
fa_ir: توکن دسترسی

# Validation_TokenInvalid
source: Refresh/Token is not provided pleas login
fa_ir: {PropertyName} معتبر نیست.

# FatherName_Required
source: Father's name is required.
fa_ir: نام پدر الزامیست.

# FatherName_Length
source: Father's name must be between 2 and 255 characters.
fa_ir: حداقل طول نام پدر 2 حرف و حداکثر 255 حرف می‌باشد.

# NationalCode_Required
source: National code is required.
fa_ir: کد ملی الزامیست.

# NationalCode_Length
source: National code must be 10 digits.
fa_ir: طول کد ملی باید 10 عدد باشد.

# NationalCode_Numeric
source: National code must contain only numbers.
fa_ir: کد ملی باید فقط شامل اعداد باشد.

# Gender_Required
source: Gender is required.
fa_ir: جنسیت الزامیست.

# IsLeader_Required
source: Leader status is required.
fa_ir: وضعیت سرگروه الزامیست.

# PersonnelNumber_Required
source: Personnel number is required.
fa_ir: شماره پرسنلی الزامیست.

# DepartmentId_Required
source: Department is required.
fa_ir: دپارتمان الزامیست.

# Code_Required
source: Code is required.
fa_ir: کد الزامی است.

# Code_Length
source: Code must be 6 digits.
fa_ir: کد باید 6 رقم باشد.
